import time # імпортируйем час
import pygame # імпортируйем  pygame
from tkinter import* # імпортируйем ткінтер
from tkinter import messagebox # обраща емся к ткінтеру щоб імпртирував меседжбокс

Tk().wm_withdraw()
pygame.init() # обращаемся к пайгейм

qwerty = pygame.display.set_mode((960,360))#создайем окно і десплейем разрешеня і создайем переміну
pygame.display.set_caption("собщеня")#оброщаемся к пайгейм і ставим назву caption - це штучка призапуски видно що вонайе с ліва в верху
shreet = pygame.font.SysFont("lucida consola",200)# создайем почерк шрифта і розмір і переміну
shreet2 = shreet.render("це вірус",1,(255,255,255))# создайем переміну і в переміні звертайемся к переміні  создайем надпис і розміщайем і пишим коляр надпісі в форматі rgb

while True: # в казівник коли програма запущена
    for event in pygame.event.get(): # собитя я ки ми використовувайем
        if event.type == pygame.QUIT: # ця стічка відповідайе за нажая на кнопку вихода
            pygame.quit() # при на жаті кнопку вихода ця функція запускайется і виходится с віруса
            time.sleep(0.10) # через скока секунд окно мусет запуститися заново
            qwerty = pygame.display.set_mode((960,360))  # создайем окно і десплейем разрешеня і создайем перемінуіні і создайем коляр фона в формаі rgb rgb - деможна взяти кольра в форматі rgb пишем в гуглі конвертація кольрів і там йе сайти например https://colourinfo.com/color-converter/
            pygame.display.set_caption("собщеня")  # оброщаемся к пайгейм і ставим назву caption - це штучка призапуски видно що вонайе с ліва в верху
            messagebox.showerror('ахаха','очистеня данів') #миделайем текст на окне которий будет спливати при а жаті кнопки вихода
    qwerty.fill((0,0,0))#бращаемся к переменой і ставим коляр фону
    qwerty.blit(shreet2,(100,100))# робим так шоб вивисти шрифт на екран оброщаемся к перемений в ній знов оброщаемся к перміні і задайем парометри йему
    pygame.display.update() # делайем так шоб кожен раз обновлявся пайгем  дісплей








